# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000
full_expenses = 12000

while educational_grant < expenses:
    for _ in range(2, 11):
        expenses += expenses * 0.03
        full_expenses += expenses
    educational_grant = educational_grant * 10
    result = round(educational_grant + full_expenses, 2)
print(f'Студенту надо попросить {result} рублей')
